Librianets/RTL8763BF/SDK/src/app/keyboard/keyboard_app.c
/**
*****************************************************************************************
*     Copyright(c) 2018, Realtek Semiconductor Corporation. All rights reserved.
*****************************************************************************************
   * @file      keyboard_app.c
   * @brief     This file handles BLE keyboard application routines.
   * @author    parker
   * @date      2018-04-18
   * @version   v1.0
   **************************************************************************************
   * @attention
   * <h2><center>&copy; COPYRIGHT 2018 Realtek Semiconductor Corporation</center></h2>
   **************************************************************************************
  */

/*============================================================================*
 *                              Header Files
 *============================================================================*/
#include <trace.h>
#include <string.h>
#include <gap.h>
#include <gap_adv.h>
#include <gap_bond_le.h>
#include <gap_storage_le.h>
#include <profile_server.h>
#include <bas.h>
#include <gap_conn_le.h>
#include <keyboard_app.h>
#include <hids_kb.h>
#include <keyscan.h>
#include <key_handler.h>
#include <keyboard_button.h>
#include <keyboard_led.h>
#include <gap_privacy.h>
#include <privacy_mgnt.h>
#include <profile_init.h>
#include "ota_service.h"
#include <dfu_api.h>
#include <rtl876x_wdg.h>

/** @defgroup  PERIPH_APP Peripheral Application
    * @brief This file handles BLE peripheral application routines.
    * @{
    */
/*============================================================================*
 *                              Variables
 *============================================================================*/
/** @addtogroup  PERIPH_SEVER_CALLBACK Profile Server Callback Event Handler
    * @brief Handle profile server callback event
    * @{
    */
T_SERVER_ID hid_srv_id; /**< HID service id*/
T_SERVER_ID bas_srv_id;  /**< Battery service id */
T_SERVER_ID dis_srv_id;  /**< Device Information service id */
T_SERVER_ID ota_srv_id;  /**< Device Information service id */
/** @} */ /* End of group PERIPH_SEVER_CALLBACK */
/** @defgroup  PERIPH_GAP_MSG GAP Message Handler
    * @brief Handle GAP Message
    * @{
    */
T_GAP_DEV_STATE gap_dev_state = {0, 0, 0, 0};                 /**< GAP device state */
T_GAP_CONN_STATE gap_conn_state = GAP_CONN_STATE_DISCONNECTED; /**< GAP connection state */

uint8_t keyboard_con_id;
bool switch_into_ota_pending = false;
bool report_cccd_enable = false;
bool resolv_list_exist = false;

/*============================================================================*
 *                              Functions
 *============================================================================*/
void app_handle_gap_msg(T_IO_MSG  *p_gap_msg);
/**
 * @brief    All the application messages are pre-handled in this function
 * @note     All the IO MSGs are sent to this function, then the event handling
 *           function shall be called according to the MSG type.
 * @param[in] io_msg  IO message data
 * @return   void
 */
void app_handle_io_msg(T_IO_MSG io_msg)
{
    uint16_t msg_type = io_msg.type;

    switch (msg_type)
    {
    case IO_MSG_TYPE_BT_STATUS:
        {
            app_handle_gap_msg(&io_msg);
        }
        break;
    case IO_MSG_TYPE_GPIO:
        {
            handle_pair_button_event(io_msg);
        }
        break;
    case IO_MSG_TYPE_KEYSCAN:
        {
            if (io_msg.subtype == IO_MSG_KEYSCAN_RX_PKT)
            {
                T_KEYSCAN_FIFIO_DATA *p_key_data = io_msg.u.buf;
                APP_PRINT_INFO0("KeyScan MSG, Sub type Scan end.");
                if (passkey.enable_input)
                {
                    keyboard_handle_pair_event(p_key_data);
                }
                else if (report_cccd_enable)
                {
                    keyboard_handle_press_event(p_key_data);
                }
                else
                {
                    if (gap_conn_state == GAP_CONN_STATE_DISCONNECTED && \
                        gap_dev_state.gap_adv_state == GAP_ADV_STATE_IDLE)
                    {
                        APP_PRINT_INFO1("keyscan trigger adv, resolv_list_exist = %d", resolv_list_exist);
                        if (resolv_list_exist)
                        {
                            keyboard_start_adv(ADV_RECONECT);
                            start_adv_led_timer(true);
                        }
                    }
                }
            }
            else if (io_msg.subtype == IO_MSG_KEYSCAN_ALLKEYRELEASE)
            {
                APP_PRINT_INFO0("KeyScan MSG, Sub type All realse.");
                if (passkey.enable_input == false && report_cccd_enable)
                {
                    keyboard_handle_release_event();
                }
            }

        }
        break;
    default:
        break;
    }
}

/**
 * @brief    Handle msg GAP_MSG_LE_DEV_STATE_CHANGE
 * @note     All the gap device state events are pre-handled in this function.
 *           Then the event handling function shall be called according to the new_state
 * @param[in] new_state  New gap device state
 * @param[in] cause GAP device state change cause
 * @return   void
 */
void app_handle_dev_state_evt(T_GAP_DEV_STATE new_state, uint16_t cause)
{
    APP_PRINT_INFO3("app_handle_dev_state_evt: init state %d, adv state %d, cause 0x%x",
                    new_state.gap_init_state, new_state.gap_adv_state, cause);
    if (gap_dev_state.gap_init_state != new_state.gap_init_state)
    {
        if (new_state.gap_init_state == GAP_INIT_STATE_STACK_READY)
        {
            APP_PRINT_INFO0("GAP stack ready");
            privacy_init(true);
        }
    }

    if (gap_dev_state.gap_adv_state != new_state.gap_adv_state)
    {
        if (new_state.gap_adv_state == GAP_ADV_STATE_IDLE)
        {
            if (new_state.gap_adv_sub_state == GAP_ADV_TO_IDLE_CAUSE_CONN)
            {
                APP_PRINT_INFO0("GAP adv stoped: because connection created");
            }
            else
            {
                APP_PRINT_INFO0("GAP adv stoped");
                if (start_pair_adv)
                {
                    start_pair_adv = false;
                    le_privacy_set_addr_resolution(false);
                    le_bond_clear_all_keys();//maybe move this to privacy_handle_le_privacy_resolution_status_info
                }
            }
        }
        else if (new_state.gap_adv_state == GAP_ADV_STATE_ADVERTISING)
        {
            APP_PRINT_INFO0("GAP adv start");
        }
    }

    gap_dev_state = new_state;
}

/**
 * @brief    Handle msg GAP_MSG_LE_CONN_STATE_CHANGE
 * @note     All the gap conn state events are pre-handled in this function.
 *           Then the event handling function shall be called according to the new_state
 * @param[in] conn_id Connection ID
 * @param[in] new_state  New gap connection state
 * @param[in] disc_cause Use this cause when new_state is GAP_CONN_STATE_DISCONNECTED
 * @return   void
 */
void app_handle_conn_state_evt(uint8_t conn_id, T_GAP_CONN_STATE new_state, uint16_t disc_cause)
{
    APP_PRINT_INFO4("app_handle_conn_state_evt: conn_id %d old_state %d new_state %d, disc_cause 0x%x",
                    conn_id, gap_conn_state, new_state, disc_cause);
    switch (new_state)
    {
    case GAP_CONN_STATE_DISCONNECTED:
        {
            if ((disc_cause != (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE))
                && (disc_cause != (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE)))
            {
                APP_PRINT_ERROR1("app_handle_conn_state_evt: connection lost cause 0x%x", disc_cause);
            }

            stop_con_update_timer();
            report_cccd_enable = false;
            passkey.enable_input = false;

            if (switch_into_ota_pending)
            {
                switch_into_ota_pending = false;
                dfu_switch_to_ota_mode();
                WDG_SystemReset(RESET_ALL_EXCEPT_AON, DFU_SWITCH_TO_OTA);
            }

            if (resolv_list_exist == false)
            {
                start_pair_adv = true;
            }

