Librianets/RTL8763BF/SDK/src/app/keyboard/keyboard_app.c
        switch (p_hid_cb_data->msg_type)
        {
        case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
            {
                switch (p_hid_cb_data->msg_data.not_ind_data.index)
                {
                case GATT_SVC_HID_REPORT_INPUT_CCCD_INDEX:
                    {
                        if (p_hid_cb_data->msg_data.not_ind_data.value == NOTIFY_ENABLE)
                        {
                            report_cccd_enable = true;
                        }
                        else
                        {
                            report_cccd_enable = false;
                        }
                    }
                    break;
                case GATT_SVC_HID_BOOT_KB_IN_REPORT_CCCD_INDEX:
                    {

                    }
                    break;
                default:
                    break;
                }
            }
            break;
        case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:
            {
                switch (p_hid_cb_data->msg_data.read_value_index)
                {
                case GATT_SVC_HID_PROTOCOL_MODE_INDEX:
                    {
                        APP_PRINT_INFO1("HID_WRITE_PROTOCOL MODE %d\n",
                                        p_hid_cb_data->msg_data.write_msg.write_parameter.protocol_mode);
                        break;
                    }
                case GATT_SVC_HID_REPORT_OUTPUT_INDEX:
                    {
                        //callback data definition need to modify.
                        APP_PRINT_INFO1("HID_OUTPUT value %d\n", p_hid_cb_data->msg_data.write_msg.write_parameter.output);
                        if (p_hid_cb_data->msg_data.write_msg.write_parameter.output & 0x02)
                        {
                            capslock_led_on();
                        }
                        else
                        {
                            capslock_led_off();
                        }
                        break;
                    }
                default:
                    break;
                }
            }
            break;
        default:
            break;
        }
    }
    else if (service_id == bas_srv_id)
    {
        T_BAS_CALLBACK_DATA *p_bas_cb_data = (T_BAS_CALLBACK_DATA *)p_data;
        switch (p_bas_cb_data->msg_type)
        {
        case SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION:
            {
                switch (p_bas_cb_data->msg_data.notification_indification_index)
                {
                case BAS_NOTIFY_BATTERY_LEVEL_ENABLE:
                    {
                        APP_PRINT_INFO0("BAS_NOTIFY_BATTERY_LEVEL_ENABLE");
                    }
                    break;

                case BAS_NOTIFY_BATTERY_LEVEL_DISABLE:
                    {
                        APP_PRINT_INFO0("BAS_NOTIFY_BATTERY_LEVEL_DISABLE");
                    }
                    break;
                default:
                    break;
                }
            }
            break;

        case SERVICE_CALLBACK_TYPE_READ_CHAR_VALUE:
            {
                if (p_bas_cb_data->msg_data.read_value_index == BAS_READ_BATTERY_LEVEL)
                {
                    uint8_t battery_level = 90;
                    APP_PRINT_INFO1("BAS_READ_BATTERY_LEVEL: battery_level %d", battery_level);
                    bas_set_parameter(BAS_PARAM_BATTERY_LEVEL, 1, &battery_level);
                }
            }
            break;

        default:
            break;
        }
    }
    else if (service_id == ota_srv_id)
    {

        TOTA_CALLBACK_DATA *pOTACallbackData = (TOTA_CALLBACK_DATA *)p_data;
        switch (pOTACallbackData->msg_type)
        {
        case SERVICE_CALLBACK_TYPE_WRITE_CHAR_VALUE:

            if (OTA_WRITE_CHAR_VAL == pOTACallbackData->msg_data.write.opcode &&
                OTA_VALUE_ENTER == pOTACallbackData->msg_data.write.u.value)
            {

                /*battery level is above 60 percent*/
                APP_PRINT_INFO0("Preparing switch into OTA mode\n");
                /*prepare to enter OTA mode, before switch action, we should disconnect first.*/
                switch_into_ota_pending = true;
                le_disconnect(keyboard_con_id);
            }
            else if (OTA_WRITE_IMAGE_COUNT_VAL == pOTACallbackData->msg_data.write.opcode)
            {

            }

            break;

        default:

            break;
        }
    }

    return app_result;
}

/** @} */ /* End of group PERIPH_SEVER_CALLBACK */
/** @} */ /* End of group PERIPH_APP */
